#数据类型及操作
'''
    整数类型
    浮点数类型
    复数类型
    数值运算操作符
    数值运算函数
'''
'''
    1.整数类型
    可正可负，无范围pow()
    十进制：1010,99，-11
    二进制，以0b或0B开头：0b0101，-0B011
    八进制，以0o或0O开头：0o123，-0O567
    十六进制，以0x或0X开头：0x9a，-0X89

    2.浮点数类型
    带有小数点及小数的数字
    取值范围约（-10^308 ~ 10^308）,精度数量级10^-16
    浮点数间运算存在不确定尾数，不是bug，采用round来辅助计算
    round(x,d）：对x四舍五入，d是小数截取位数
    浮点数的科学计数法：<a>e<b>表示a*10^b

    3.复数类型,与数学中的概率一致
    定义j = 根号(-1)
    z = 1.23e-4 + 5.6e+89j
    z.real = 1.23e-4 : 获取实部
    z.imag = 5.6e+89 : 获取虚部
    
    4.数值运算操作符
    +、-、*、/、%
    x//y ：取商
    x**y ：y in 小数？开方运算：幂运算
    数值类型的关系: 整数-->浮点数-->复数

    5.数值运算函数
    abs(x):绝对值
    divmode(x,y):商余，（x//y,x%y）--> (3,1)
    pow(x,y[,z]):幂余，(x**y)/z
    round(x[,d]):四舍五入
    min or max(x1,x2,...,xn):最小值 or 最大值
    int(x):将x变为整数，舍弃小数部分
    float(x):将x变为浮点数，增加小数部分
    complex(x):将x变为复数，增加虚数部分 complex(5) = 5+0j
    
    
'''
