#File About
'''
    文件的类型
    文件的打开方式
    文件内容的读取
    数据的文件写入
'''
'''
    1.文件的理解：
        文件是存储在辅助存储器上的数据序列
        文件是数据存储的一种形式
        文件展示形态：文本文件和二进制文件
    2.文件的打开和关闭：
                       a.open( , ) 
        文件的存储状态<======>文件的占用状态
                       a.close()
        文件的打开：
        <变量名> = open(<文件名>，<打开模式>)
        文件句柄   文件路径和名称  文件or二进制，读or写

        打开模式:
        'r'--->只读模式，默认值，如果文件不存在，返回FileNotFoundError
        'w'--->覆盖写模式，文件不存在则创建，存在则完全覆盖
        'x'--->创建写模式，文件不存在则创建，存在则返回FileExitsError
        'a'--->追加写模式，文件不存在则创建，存在则在文件最后追加内容
        'b'--->二进制文件模式
        't'--->文本文件模式，默认值
        '+'--->与r/w/x/a一同使用，在原功能基础上同时增加读写功能
    3.文件内容的读取：
        <f>.read(size=-1)--->读取前size内容
        <f>.readline(size=-1)--->读取行前size内容
        <f>.readlines(hint=-1)--->读取前hint行，以每行为元素形成列表
        
'''

tf = open("f.txt","w")

